ff8zgs/vsf/vsf/interfaces/cpu/stm32f4/usart/stm32f4usart.c
#include <Stdint.h>
#include "stm32f4xx.h"
#include "vsf_err.h"
#include "App_type.h"
#include "interfaces.h"
#define STM32F4_AFIO_MAPR_USART1			((uint32_t)1 << 2)
#define STM32F4_AFIO_MAPR_USART2			((uint32_t)1 << 3)
#define STM32F4_AFIO_MAPR_USART3_SFT		((uint32_t)1 << 4)
#define STM32F4_AFIO_MAPR_USART3_MSK		((uint32_t)0X03 << \
																				STM32_AFIO_MAPR_USART3_SFT)
#define STM32F4_AFIO_MAPR_SWJCFG			((uint32_t)7 << 24)

#define STM32F4_RCC_APB1ENR_USART2EN		((uint32_t)1 << 17)
#define STM32F4_RCC_APB1ENR_USART3EN		((uint32_t)1 << 18)
#define STM32F4_RCC_APB1ENR_USART4EN		((uint32_t)1 << 19)
#define STM32F4_RCC_APB1ENR_USART5EN		((uint32_t)1 << 20)
#define STM32F4_RCC_APB2ENR_USART1EN		((uint32_t)1 << 14)
#define STM32F4_RCC_APB2ENR_IOPAEN		((uint32_t)1 << 2)
#define STM32F4_RCC_APB2ENR_IOPBEN		((uint32_t)1 << 3)
#define STM32F4_RCC_APB2ENR_IOPCEN		((uint32_t)1 << 4)
#define STM32F4_RCC_APB2ENR_IOPDEN		((uint32_t)1 << 5)

#define STM32F4_USART_SR_TXE				((uint32_t)1 << 7)
#define STM32F4_USART_SR_TC				((uint32_t)1 << 6)
#define STM32F4_USART_SR_RXNE				((uint32_t)1 << 5)

#define STM32F4_USART_CR1_UE				((uint32_t)1 << 13)
#define STM32F4_USART_CR1_M				((uint32_t)1 << 12)
#define STM32F4_USART_CR1_TXEIE			((uint32_t)1 << 7)
#define STM32F4_USART_CR1_TCIE			((uint32_t)1 << 6)
#define STM32F4_USART_CR1_RXNEIE			((uint32_t)1 << 5)
#define STM32F4_USART_CR1_TE				((uint32_t)1 << 3)
#define STM32F4_USART_CR1_RE				((uint32_t)1 << 2)

#define STM32F4_USART_CR2_CLKEN			((uint32_t)1 << 11)
#define STM32F4_USART_CR2_STOP_SFT		12
#define STM32F4_USART_CR2_STOP_MSK		((uint32_t)0x03 << \
											STM32_USART_CR2_STOP_SFT)

#define STM32F4_USART_CR3_CTSE			((uint32_t)1 << 9)
#define STM32F4_USART_CR3_RTSE			((uint32_t)1 << 8)
#define STM32F4_USART_CR3_HDSEL			((uint32_t)1 << 3)

#define AF_USART1 		((uint8_t)0x07)  /* USART1 Alternate Function mapping  */
#define AF_USART2 		((uint8_t)0x07)  /* USART1 Alternate Function mapping  */
#define AF_USART3 		((uint8_t)0x07)  /* USART1 Alternate Function mapping  */
#define AF_UART4 		((uint8_t)0x08)  /* USART1 Alternate Function mapping  */
#define AF_UART5 		((uint8_t)0x08)  /* USART1 Alternate Function mapping  */
#define AF_UART6 		((uint8_t)0x08)  /* USART1 Alternate Function mapping  */

typedef enum
{ 
  GPIO_Mode_IN   = 0x00, /*!< GPIO Input Mode */
  GPIO_Mode_OUT  = 0x01, /*!< GPIO Output Mode */
  GPIO_Mode_AF   = 0x02, /*!< GPIO Alternate function Mode */
  GPIO_Mode_AN   = 0x03  /*!< GPIO Analog Mode */
}GPIOMode_TypeDef;

typedef enum
{ 
  GPIO_OType_PP = 0x00,
  GPIO_OType_OD = 0x01
}GPIOOType_TypeDef;


typedef enum
{ 
  GPIO_Low_Speed     = 0x00, /*!< Low speed    */
  GPIO_Medium_Speed  = 0x01, /*!< Medium speed */
  GPIO_High_Speed    = 0x02, /*!< Fast speed   */
  GPIO_VeryHigh_Speed    = 0x03  /*!< High speed   */
}GPIOSpeed_TypeDef;

#define	 GPIO_PUPDR_NP				0
#define 	GPIO_PUPDR_PU				1
#define	GPIO_PUPDR_PD				2
#define	GPIO_PUPDR_RE				3
/** 
  * @brief  GPIO Configuration PullUp PullDown enumeration 
  */ 
typedef enum
{ 
  GPIO_PuPd_NOPULL = 0x00,
  GPIO_PuPd_UP     = 0x01,
  GPIO_PuPd_DOWN   = 0x02
}GPIOPuPd_TypeDef;
#define USART_NUM  2
static void (*stm32f4_usart_ontx[USART_NUM])(void *);
static void (*stm32f4_usart_onrx[USART_NUM])(void *, uint16_t data);
static void *stm32f4_usart_callback_param[USART_NUM];

static const uint8_t stm32f4_usart_irqn[USART_NUM] = 
{
#if USART_NUM >= 1
	USART1_IRQn, 
#endif
#if USART_NUM >= 2
	USART2_IRQn, 
#endif
#if USART_NUM >= 3
	USART3_IRQn, 
#endif
#if USART_NUM >= 4
	UART4_IRQn, 
#endif
#if USART_NUM >= 5
	UART5_IRQn
#endif
#if USART_NUM >= 6
	USART6_IRQn
#endif
#if USART_NUM >= 7
	UART7_IRQn, 
#endif
#if USART_NUM >= 8
	UART8_IRQn
#endif
};
static const USART_TypeDef *stm32f4_usarts[USART_NUM] = 
{
#if USART_NUM >= 1
	USART1, 
#endif
#if USART_NUM >= 2
	USART2, 
#endif
#if USART_NUM >= 3
	USART3, 
#endif
#if USART_NUM >= 4
	UART4, 
#endif
#if USART_NUM >= 5
	UART5
#endif
#if USART_NUM >= 6
	USART6
#endif
#if USART_NUM >= 7
	UART7
#endif
#if USART_NUM >= 8
	UART8
#endif
};

vsf_err_t stm32f4_usart_init(uint8_t index)
{
	uint8_t usart_idx = index & 0x0F;
	uint8_t remap_idx = (index >> 4) & 0x0F;
	
#if __VSF_DEBUG__
	if (usart_idx >= USART_NUM)
	{
		return VSFERR_NOT_SUPPORT;
	}
#endif
	switch (usart_idx)
	{
		case 0:
		{
			RCC->APB2ENR|=RCC_APB2ENR_USART1EN;
			switch (remap_idx)
			{
				case 0:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOAEN;

				   #ifdef USART00_RX_ENABLE	//PA_10
					GPIOA->AFR[1]&=~((uint32_t)(0x0f<<8));
					GPIOA->AFR[1]|=(uint32_t)(AF_USART1<<8);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<20);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<20);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<10);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<10);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<20);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<20);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<20);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<20);
				   #endif

				   #ifdef USART00_TX_ENABLE		//PA9
					GPIOA->AFR[1]&=~((uint32_t)(0x0f<<4));
					GPIOA->AFR[1]|=(uint32_t)(AF_USART1<<4);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<18);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<18);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<9);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<9);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<18);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<18);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<18);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<18);	   
				   #endif
				   
				   #ifdef USART00_CK_ENABLE		//PA8
				   	GPIOA->AFR[1]&=~((uint32_t)(0x0f));
					GPIOA->AFR[1]|=(uint32_t)(AF_USART1);
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<16);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<16);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<8);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<8);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<16);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<16);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<16);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<16);
				    #endif

				   #ifdef USART00_CTS_ENABLE//pA11
				    	GPIOA->AFR[1]&=~((uint32_t)(0x0f<<12));
					GPIOA->AFR[1]|=(uint32_t)(AF_USART1<<12);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<22);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<22);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<11);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<11);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<22);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<22);	
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<22);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<22);
					#endif
				   
					#ifdef USART00_RTS_ENABLE//PA12
				  GPIOA->AFR[1]&=~((uint32_t)(0x0f<<16));
					GPIOA->AFR[1]|=(uint32_t)(AF_USART1<<16);
					
