ff8zgs/vsf/vsf/interfaces/cpu/stm32f4/usart/stm32f4usart.c
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<24);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<24);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<12);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<12);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<24);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<24);	
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<24);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<24);					
					#endif
				 
				   
					break;
				}
				case 1:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOBEN;

				   #ifdef USART00_RX_ENABLE	//PB_7
				    	GPIOB->AFR[0]&=~((uint32_t)(0x0f<<28));
					GPIOB->AFR[0]|=(uint32_t)(AF_USART1<<28);
					
					GPIOB->MODER&=~((uint32_t)GPIO_Mode_AN<<14);
					GPIOB->MODER|=((uint32_t)GPIO_Mode_AF<<14);

					GPIOB->OTYPER&=~((uint32_t)GPIO_OType_OD<<7);
					GPIOB->OTYPER|=((uint32_t)GPIO_OType_PP<<7);
					
					GPIOB-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<14);
					GPIOB-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<14);
					GPIOB->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<14);
					GPIOB->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<14);				  
					#endif

				   #ifdef USART00_TX_ENABLE		//PB6
				    	GPIOB->AFR[0]&=~((uint32_t)(0x0f<<24));
					GPIOB->AFR[0]|=(uint32_t)(AF_USART1<<24);
					
					GPIOB->MODER&=~((uint32_t)GPIO_Mode_AN<<12);
					GPIOB->MODER|=((uint32_t)GPIO_Mode_AF<<12);

					GPIOB->OTYPER&=~((uint32_t)GPIO_OType_OD<<6);
					GPIOB->OTYPER|=((uint32_t)GPIO_OType_PP<<6);
					
					GPIOB-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<12);
					GPIOB-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<12);
					GPIOB->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<12);
					GPIOB->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<12);	
				   #endif
					break;
				}
				default:
				{
					return VSFERR_NOT_SUPPORT;
				}
			}
			break;
		}
		case 1:
		{
			RCC->APB1ENR|=RCC_APB1ENR_USART2EN;
			switch (remap_idx)
			{
				case 0:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOAEN;

				   #ifdef USART01_RX_ENABLE	//PA3
					GPIOA->AFR[0]&=~((uint32_t)(0x0f<<12));
					GPIOA->AFR[0]|=(uint32_t)(AF_USART2<<12);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<6);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<6);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<3);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<3);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<6);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<6);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<6);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<6);	
				   #endif
				   #ifdef USART01_TX_ENABLE	//PA2
					GPIOA->AFR[0]&=~((uint32_t)(0x0f<<8));
					GPIOA->AFR[0]|=(uint32_t)(AF_USART2<<8);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<4);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<4);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<2);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<2);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<4);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<4);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<4);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<4);	
				   #endif				   

				   #ifdef USART01_RTS_ENABLE	//PA1
					GPIOA->AFR[0]&=~((uint32_t)(0x0f<<4));
					GPIOA->AFR[0]|=(uint32_t)(AF_USART2<<4);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<2);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<2);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<1);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<1);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<2);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<2);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<2);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<2);	
				   #endif	

				   #ifdef USART01_CTS_ENABLE	//PA0
					GPIOA->AFR[0]&=~((uint32_t)(0x0f));
					GPIOA->AFR[0]|=(uint32_t)(AF_USART2);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU);	
				   #endif	

				   #ifdef USART01_CK_ENABLE	//PA4
					GPIOA->AFR[0]&=~((uint32_t)(0x0f<<16));
					GPIOA->AFR[0]|=(uint32_t)(AF_USART2<<16);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<8);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<8);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<4);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<4);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<8);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<8);
					
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<8);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<8);	
				   #endif					   
				   	break;
				   	
				  }
				case 1:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIODEN;

					 #ifdef USART01_RX_ENABLE	//PD6
					GPIOD->AFR[0]&=~((uint32_t)(0x0f<<24));
					GPIOD->AFR[0]|=(uint32_t)(AF_USART2<<24);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<12);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<12);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<6);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<6);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<12);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<12);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<12);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<12);	
					 #endif

					 #ifdef USART01_TX_ENABLE	//PD5
					GPIOD->AFR[0]&=~((uint32_t)(0x0f<<20));
					GPIOD->AFR[0]|=(uint32_t)(AF_USART2<<20);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<10);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<10);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<5);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<5);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<10);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<10);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<10);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<10);	
					 #endif
					 break;

					 #ifdef USART01_CK_ENABLE	//PD7
					GPIOD->AFR[0]&=~((uint32_t)(0x0f<<28));
					GPIOD->AFR[0]|=(uint32_t)(AF_USART2<<28);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<14);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<14);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<7);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<7);
					
