ff8zgs/vsf/vsf/interfaces/cpu/stm32f4/usart/stm32f4usart.c
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<14);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<14);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<14);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<14);
					 #endif
					 
					 #ifdef USART01_RTS_ENABLE	//PD4
					GPIOD->AFR[0]&=~((uint32_t)(0x0f<<16));
					GPIOD->AFR[0]|=(uint32_t)(AF_USART2<<16);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<8);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<8);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<4);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<4);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<8);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<8);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<8);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<8);
					 #endif		

					 #ifdef USART01_CTS_ENABLE	//PD3
					GPIOD->AFR[0]&=~((uint32_t)(0x0f<<12));
					GPIOD->AFR[0]|=(uint32_t)(AF_USART2<<12);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<6);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<6);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<3);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<3);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<6);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<6);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<6);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<6);
					 #endif				
					 break;
				}
				default :
				 return VSFERR_NOT_SUPPORT;
			}
			break;
		}
		case 2:
		{
			RCC->APB1ENR|=RCC_APB1ENR_USART3EN;
			switch (remap_idx)
			{
				case 0:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOBEN;
			  	 #ifdef USART02_TX_ENABLE	//PB10
					GPIOB->AFR[0]&=~((uint32_t)(0x0f<<8));
					GPIOB->AFR[0]|=(uint32_t)(AF_USART3<<8);
					
					GPIOB->MODER&=~((uint32_t)GPIO_Mode_AN<<20);
					GPIOB->MODER|=((uint32_t)GPIO_Mode_AF<<20);

					GPIOB->OTYPER&=~((uint32_t)GPIO_OType_OD<<10);
					GPIOB->OTYPER|=((uint32_t)GPIO_OType_PP<<10);
					
					GPIOB-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<20);
					GPIOB-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<20);
					GPIOB->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<20);
					GPIOB->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<20);
				   #endif		

			  	 #ifdef USART02_RX_ENABLE	//PB11
					GPIOB->AFR[0]&=~((uint32_t)(0x0f<<12));
					GPIOB->AFR[0]|=(uint32_t)(AF_USART3<<12);
					
					GPIOB->MODER&=~((uint32_t)GPIO_Mode_AN<<22);
					GPIOB->MODER|=((uint32_t)GPIO_Mode_AF<<22);

					GPIOB->OTYPER&=~((uint32_t)GPIO_OType_OD<<11);
					GPIOB->OTYPER|=((uint32_t)GPIO_OType_PP<<11);
					
					GPIOB-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<22);
					GPIOB-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<22);
					GPIOB->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<22);
					GPIOB->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<22);
				   #endif		
				   
			  	 #ifdef USART02_CK_ENABLE	//PB12
					GPIOB->AFR[0]&=~((uint32_t)(0x0f<<16));
					GPIOB->AFR[0]|=(uint32_t)(AF_USART3<<16);
					
					GPIOB->MODER&=~((uint32_t)GPIO_Mode_AN<<24);
					GPIOB->MODER|=((uint32_t)GPIO_Mode_AF<<24);

					GPIOB->OTYPER&=~((uint32_t)GPIO_OType_OD<<12);
					GPIOB->OTYPER|=((uint32_t)GPIO_OType_PP<<12);
					
					GPIOB-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<24);
					GPIOB-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<24);
					GPIOB->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<24);
					GPIOB->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<24);
				   #endif
			  	 #ifdef USART02_CTS_ENABLE	//PB13
					GPIOB->AFR[0]&=~((uint32_t)(0x0f<<20));
					GPIOB->AFR[0]|=(uint32_t)(AF_USART3<<20);
					
					GPIOB->MODER&=~((uint32_t)GPIO_Mode_AN<<26);
					GPIOB->MODER|=((uint32_t)GPIO_Mode_AF<<26);

					GPIOB->OTYPER&=~((uint32_t)GPIO_OType_OD<<13);
					GPIOB->OTYPER|=((uint32_t)GPIO_OType_PP<<13);
					
					GPIOB-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<26);
					GPIOB-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<26);
					GPIOB->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<26);
					GPIOB->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<26);
				   #endif		
			  	 #ifdef USART02_RX_ENABLE	//PB14
					GPIOB->AFR[0]&=~((uint32_t)(0x0f<<24));
					GPIOB->AFR[0]|=(uint32_t)(AF_USART3<<24);
					
					GPIOB->MODER&=~((uint32_t)GPIO_Mode_AN<<28);
					GPIOB->MODER|=((uint32_t)GPIO_Mode_AF<<28);

					GPIOB->OTYPER&=~((uint32_t)GPIO_OType_OD<<14);
					GPIOB->OTYPER|=((uint32_t)GPIO_OType_PP<<14);
					
					GPIOB-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<28);
					GPIOB-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<28);
					GPIOB->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<28);
					GPIOB->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<28);
				   #endif					
				   break;
				}
				case 1:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIODEN;
			  	 #ifdef USART02_TX_ENABLE	//PD8
					GPIOD->AFR[1]&=~((uint32_t)(0x0f));
					GPIOD->AFR[1]|=(uint32_t)(AF_USART3);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<16);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<16);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<8);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<8);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<16);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<16);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<16);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<16);
				   #endif		
			  	 #ifdef USART02_RX_ENABLE	//PD9
					GPIOD->AFR[1]&=~((uint32_t)(0x0f<<4));
					GPIOD->AFR[1]|=(uint32_t)(AF_USART3<<4);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<18);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<18);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<9);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<9);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<18);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<18);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<18);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<18);
				   #endif		
			  	 #ifdef USART02_CK_ENABLE	//PD10
					GPIOD->AFR[1]&=~((uint32_t)(0x0f<<8));
					GPIOD->AFR[1]|=(uint32_t)(AF_USART3<<8);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<20);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<20);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<10);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<10);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<20);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<20);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<20);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<20);
				   #endif	
			  	 #ifdef USART02_CTS_ENABLE	//PD11
					GPIOD->AFR[1]&=~((uint32_t)(0x0f<<12));
					GPIOD->AFR[1]|=(uint32_t)(AF_USART3<<12);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<22);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<22);

