ff8zgs/vsf/vsf/interfaces/cpu/stm32f4/usart/stm32f4usart.c
					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<11);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<11);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<22);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<22);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<22);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<22);
				   #endif	
			  	 #ifdef USART02_RTS_ENABLE	//PD12
					GPIOD->AFR[1]&=~((uint32_t)(0x0f<<16));
					GPIOD->AFR[1]|=(uint32_t)(AF_USART3<<16);
					
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<24);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<24);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<12);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<12);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<24);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<24);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<24);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<24);
				   #endif	
					break;
				}
				case 2:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOCEN;
		  	 	#ifdef USART02_TX_ENABLE	//PC10
					GPIOC->AFR[1]&=~((uint32_t)(0x0f<<8));
					GPIOC->AFR[1]|=(uint32_t)(AF_USART3<<8);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<20);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<20);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<10);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<10);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<20);
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<20);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<20);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<20);
				   #endif	

		  	 	#ifdef USART02_RX_ENABLE	//P11
					GPIOC->AFR[1]&=~((uint32_t)(0x0f<<12));
					GPIOC->AFR[1]|=(uint32_t)(AF_USART3<<12);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<22);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<22);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<11);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<11);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<22);
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<22);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<22);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<22);
				   #endif

		  	 	#ifdef USART02_CK_ENABLE	//P12
					GPIOC->AFR[1]&=~((uint32_t)(0x0f<<16));
					GPIOC->AFR[1]|=(uint32_t)(AF_USART3<<16);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<24);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<24);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<12);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<12);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<24);
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<24);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<24);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<24);
				   #endif
					break;
				}
				default :
					return VSFERR_NOT_SUPPORT;
			}
			break;
		}			
		case 3:
		{
			RCC->APB2ENR|=RCC_APB1ENR_UART4EN;
			switch (remap_idx)
			{
				case 0:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOAEN;
			 	#ifdef USART03_TX_ENABLE	//PA0
					GPIOA->AFR[0]&=~((uint32_t)(0x0f));
					GPIOA->AFR[0]|=(uint32_t)(AF_UART4);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU);
				#endif	

				#ifdef USART03_RX_ENABLE	//PA1
					GPIOA->AFR[0]&=~((uint32_t)(0x0f)<<4);
					GPIOA->AFR[0]|=(uint32_t)(AF_UART4<<4);
					
					GPIOA->MODER&=~((uint32_t)GPIO_Mode_AN<<2);
					GPIOA->MODER|=((uint32_t)GPIO_Mode_AF<<2);

					GPIOA->OTYPER&=~((uint32_t)GPIO_OType_OD<<1);
					GPIOA->OTYPER|=((uint32_t)GPIO_OType_PP<<1);
					
					GPIOA-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<2);
					GPIOA-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<2);
					GPIOA->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<2);
					GPIOA->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<2);
				#endif	
					break;
				}
				case 1:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOCEN;
					 #ifdef USART03_TX_ENABLE	//PC10
					GPIOC->AFR[1]&=~((uint32_t)(0x0f)<<8);
					GPIOC->AFR[1]|=(uint32_t)(AF_UART4<<8);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<20);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<20);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<10);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<10);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<20);
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<20);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<20);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<20);
				#endif
				
				#ifdef USART03_RX_ENABLE	//PC11
					GPIOC->AFR[1]&=~((uint32_t)(0x0f)<<12);
					GPIOC->AFR[1]|=(uint32_t)(AF_UART4<<12);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<22);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<22);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<11);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<11);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<22 );
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<22);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<22);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<22);
				#endif
					break;	
				}
				default :
						return VSFERR_NOT_SUPPORT;
			}
			break;
		}

		case 4:
		{
			RCC->APB1ENR|=RCC_APB1ENR_UART5EN;
			switch (remap_idx)
			{
				case 0:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOCEN;
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIODEN;
				#ifdef USART04_TX_ENABLE	//PC12
					GPIOC->AFR[1]&=~((uint32_t)(0x0f)<<16);
					GPIOC->AFR[1]|=(uint32_t)(AF_UART5<<16);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<24);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<24);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<12);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<12);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<24);
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<24);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<24);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<24);
				#endif
				#ifdef USART04_RX_ENABLE	//PD2
					GPIOD->AFR[0]&=~((uint32_t)(0x0f)<<8);
					GPIOD->AFR[0]|=(uint32_t)(AF_UART5<<8);
					
