ff8zgs/vsf/vsf/interfaces/cpu/stm32f4/usart/stm32f4usart.c
					GPIOD->MODER&=~((uint32_t)GPIO_Mode_AN<<4);
					GPIOD->MODER|=((uint32_t)GPIO_Mode_AF<<4);

					GPIOD->OTYPER&=~((uint32_t)GPIO_OType_OD<<2);
					GPIOD->OTYPER|=((uint32_t)GPIO_OType_PP<<2);
					
					GPIOD-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<4);
					GPIOD-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<4);
					GPIOD->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<4);
					GPIOD->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<4);
				#endif					
					break;
				}

				default :
					return VSFERR_NOT_SUPPORT;
			}
			break;			
		}
		case 5:
		{
			RCC->APB2ENR|=RCC_APB2ENR_USART6EN;
		
			switch (remap_idx)
			{
				case 0:
				{
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOCEN;
					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOGEN;
				#ifdef USART05_TX_ENABLE	//PC6
					GPIOC->AFR[0]&=~((uint32_t)(0x0f)<<24);
					GPIOC->AFR[0]|=(uint32_t)(AF_UART5<<24);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<12);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<12);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<6);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<6);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<12);
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<12);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<12);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<12);
				#endif	

				#ifdef USART05_RX_ENABLE	//PC7
					GPIOC->AFR[0]&=~((uint32_t)(0x0f)<<28);
					GPIOC->AFR[0]|=(uint32_t)(AF_UART5<<28);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<14);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<14);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<7);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<7);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<14);
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<14);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<14);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<14);
				#endif
				#ifdef USART05_CK_ENABLE	//PC8
					GPIOC->AFR[1]&=~((uint32_t)(0x0f));
					GPIOC->AFR[1]|=(uint32_t)(AF_UART5);
					
					GPIOC->MODER&=~((uint32_t)GPIO_Mode_AN<<16);
					GPIOC->MODER|=((uint32_t)GPIO_Mode_AF<<16);

					GPIOC->OTYPER&=~((uint32_t)GPIO_OType_OD<<8);
					GPIOC->OTYPER|=((uint32_t)GPIO_OType_PP<<8);
					
					GPIOC-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<16);
					GPIOC-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<16);
					GPIOC->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<16);
					GPIOC->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<16);
				#endif
				#ifdef USART05_RTS_ENABLE	//PG8
					GPIOG->AFR[1]&=~((uint32_t)(0x0f));
					GPIOG->AFR[1]|=(uint32_t)(AF_UART5);
					
					GPIOG->MODER&=~((uint32_t)GPIO_Mode_AN<<16);
					GPIOG->MODER|=((uint32_t)GPIO_Mode_AF<<16);

					GPIOG->OTYPER&=~((uint32_t)GPIO_OType_OD<<8);
					GPIOG->OTYPER|=((uint32_t)GPIO_OType_PP<<8);
					
					GPIOG-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<16);
					GPIOG-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<16);

					GPIOG->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<16);
					GPIOG->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<16);

				#endif
				#ifdef USART05_CTS_ENABLE	//PG13
				
					GPIOG->AFR[1]&=~((uint32_t)(0x0f)<<20);
					GPIOG->AFR[1]|=(uint32_t)(AF_UART5<<20);
					
					GPIOG->MODER&=~((uint32_t)GPIO_Mode_AN<<26);
					GPIOG->MODER|=((uint32_t)GPIO_Mode_AF<<26);

					GPIOG->OTYPER&=~((uint32_t)GPIO_OType_OD<<13);
					GPIOG->OTYPER|=((uint32_t)GPIO_OType_PP<<13);
					
					GPIOG-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<26);
					GPIOG-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<26);
					GPIOG->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<26);
					GPIOG->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<26);
				#endif				
					break;
				}
				case 1:
				{

					RCC->AHB1ENR|=RCC_AHB1ENR_GPIOGEN;
				#ifdef USART05_TX_ENABLE	//PG14
					GPIOG->AFR[1]&=~((uint32_t)(0x0f)<<24);
					GPIOG->AFR[1]|=(uint32_t)(AF_UART5<<24);
					
					GPIOG->MODER&=~((uint32_t)GPIO_Mode_AN<<28);
					GPIOG->MODER|=((uint32_t)GPIO_Mode_AF<<28);

					GPIOG->OTYPER&=~((uint32_t)GPIO_OType_OD<<14);
					GPIOG->OTYPER|=((uint32_t)GPIO_OType_PP<<14);
					
					GPIOG-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<28);
					GPIOG-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<28);
					GPIOG->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<28);
					GPIOG->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<28);
				#endif
				
				#ifdef USART05_RX_ENABLE	//PG9
					GPIOG->AFR[1]&=~((uint32_t)(0x0f)<<4);
					GPIOG->AFR[1]|=(uint32_t)(AF_UART5<<4);
					
					GPIOG->MODER&=~((uint32_t)GPIO_Mode_AN<<18);
					GPIOG->MODER|=((uint32_t)GPIO_Mode_AF<<18);

					GPIOG->OTYPER&=~((uint32_t)GPIO_OType_OD<<9);
					GPIOG->OTYPER|=((uint32_t)GPIO_OType_PP<<9);
					
					GPIOG-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<18);
					GPIOG-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<18);
					GPIOG->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<18);
					GPIOG->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<18);
				#endif
				#ifdef USART05_CK_ENABLE	//PG7
					GPIOG->AFR[0]&=~((uint32_t)(0x0f)<<28);
					GPIOG->AFR[0]|=(uint32_t)(AF_UART5<<28);
					
					GPIOG->MODER&=~((uint32_t)GPIO_Mode_AN<<14);
					GPIOG->MODER|=((uint32_t)GPIO_Mode_AF<<14);

					GPIOG->OTYPER&=~((uint32_t)GPIO_OType_OD<<7);
					GPIOG->OTYPER|=((uint32_t)GPIO_OType_PP<<7);
					
					GPIOG-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<14);
					GPIOG-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<14);
					GPIOG->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<14);
					GPIOG->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<14);
				#endif
				#ifdef USART05_RTS_ENABLE	//PG12
					GPIOG->AFR[1]&=~((uint32_t)(0x0f)<<16);
					GPIOG->AFR[1]|=(uint32_t)(AF_UART5<<16);
					
					GPIOG->MODER&=~((uint32_t)GPIO_Mode_AN<<24);
					GPIOG->MODER|=((uint32_t)GPIO_Mode_AF<<24);

					GPIOG->OTYPER&=~((uint32_t)GPIO_OType_OD<<12);
					GPIOG->OTYPER|=((uint32_t)GPIO_OType_PP<<12);
					
					GPIOG-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<24);
					GPIOG-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<24);
					GPIOG->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<24);
					GPIOG->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<24);
				#endif
				#ifdef USART05_RTS_ENABLE	//PG15
					GPIOG->AFR[1]&=~((uint32_t)(0x0f)<<28);
					GPIOG->AFR[1]|=(uint32_t)(AF_UART5<<28);
					
					GPIOG->MODER&=~((uint32_t)GPIO_Mode_AN<<30);
					GPIOG->MODER|=((uint32_t)GPIO_Mode_AF<<30);

					GPIOG->OTYPER&=~((uint32_t)GPIO_OType_OD<<15);
					GPIOG->OTYPER|=((uint32_t)GPIO_OType_PP<<15);
					
					GPIOG-> OSPEEDR&= ~((uint32_t)GPIO_VeryHigh_Speed<<30);
					GPIOG-> OSPEEDR|= ((uint32_t)GPIO_High_Speed<<30);
					GPIOG->PUPDR&=~((uint32_t)GPIO_PUPDR_RE<<30);
					GPIOG->PUPDR|=((uint32_t)GPIO_PUPDR_PU<<30);
				#endif
					break;
				}
				default :
					return VSFERR_NOT_SUPPORT;
			}
			break;
		}
		default :
			return VSFERR_NOT_SUPPORT;
	
