ff8zgs/vsf/vsf/interfaces/cpu/stm32f4/usart/stm32f4usart.c
	}
	
}
#define USART00_ENABLE 	1
#define	USART00_TX_ENABLE	1
#define USART00_RX_ENABLE	1

vsf_err_t stm32f4_usart_config(uint8_t index, uint32_t baudrate, uint32_t mode)
{
	USART_TypeDef *usart;
	uint8_t usart_idx = index & 0x0F;
	uint32_t cr1 = 0, cr2 = 0, cr3 = 0;
	struct stm32f4_info_t *info;
	uint32_t module_hz;
	uint32_t mantissa, fraction, divider;
	
#if __VSF_DEBUG__
	if (usart_idx >= USART_NUM)
	{
		return VSFERR_NOT_SUPPORT;
	}
#endif
	usart = (USART_TypeDef *)stm32f4_usarts[usart_idx];
	
//	if (stm32_interface_get_info(&info))
//	{
//		return VSFERR_FAIL;
//	}
	
	cr1 = usart->CR1 & (STM32F4_USART_CR1_TCIE | STM32F4_USART_CR1_RXNEIE);
	switch (usart_idx)
	{
	#if USART00_ENABLE || USART10_ENABLE
	case 0:
	
		module_hz = 84*1000*1000;//info->apb2_periph_freq_hz;
		#if (USART00_ENABLE && USART00_TX_ENABLE) || \
			(USART10_ENABLE && USART10_TX_ENABLE)
		cr1 |= STM32F4_USART_CR1_TE;
		#endif
		#if (USART00_ENABLE && USART00_RX_ENABLE) || \
			(USART10_ENABLE && USART10_RX_ENABLE)
		cr1 |= STM32F4_USART_CR1_RE;
		#endif
		#if (USART00_ENABLE && USART00_CK_ENABLE) || \
			(USART10_ENABLE && USART10_CK_ENABLE)
		cr2 |= STM32_USART_CR2_CLKEN;
		#endif
		#if (USART00_ENABLE && USART00_CTS_ENABLE) || \
			(USART10_ENABLE && USART10_CTS_ENABLE)
		cr3 |= STM32_USART_CR3_CTSE;
		#endif
		#if (USART00_ENABLE && USART00_RTS_ENABLE) || \
			(USART10_ENABLE && USART10_RTS_ENABLE)
		cr3 |= STM32_USART_CR3_RTSE;
		#endif
		break;
	#endif
	#if USART01_ENABLE || USART11_ENABLE
	case 1:
	#endif
	#if USART11_ENABLE||USART01_ENABLE||USART02_ENABLE || USART12_ENABLE || USART32_ENABLE
	case 2:
		module_hz = info->apb1_freq_hz;
		#if  	(USART01_ENABLE && USART01_TX_ENABLE) || \
			(USART11_ENABLE && USART11_TX_ENABLE) ||\
			(USART02_ENABLE && USART02_TX_ENABLE) || \
			(USART12_ENABLE && USART12_TX_ENABLE) || \
			(USART32_ENABLE && USART32_TX_ENABLE)
		cr1 |= STM32_USART_CR1_TE;
		#endif
		#if 	(USART01_ENABLE && USART01_RX_ENABLE) || \
			(USART11_ENABLE && USART11_RX_ENABLE) ||\
			(USART02_ENABLE && USART02_RX_ENABLE) || \
			(USART12_ENABLE && USART12_RX_ENABLE) || \
			(USART32_ENABLE && USART32_RX_ENABLE)
		cr1 |= STM32_USART_CR1_RE;
		#endif
		#if 	(USART01_ENABLE && USART01_CTS_ENABLE) || \
			(USART11_ENABLE && USART11_CTS_ENABLE) ||\
			(USART02_ENABLE && USART02_CK_ENABLE)   || \
			(USART12_ENABLE && USART12_CK_ENABLE)   || \
			(USART32_ENABLE && USART32_CK_ENABLE)
		cr2 |= STM32_USART_CR2_CLKEN;
		#endif
		#if 	(USART01_ENABLE && USART01_CTS_ENABLE) || \
			(USART11_ENABLE && USART11_CTS_ENABLE) ||\
			(USART02_ENABLE && USART02_CTS_ENABLE) || \
			(USART12_ENABLE && USART12_CTS_ENABLE) || \
			(USART32_ENABLE && USART32_CTS_ENABLE)
		cr3 |= STM32_USART_CR3_CTSE;
		#endif
		#if 	 (USART01_ENABLE && USART01_RTS_ENABLE) || \
			(USART11_ENABLE && USART11_RTS_ENABLE) ||\
			(USART02_ENABLE && USART02_RTS_ENABLE) || \
			(USART12_ENABLE && USART12_RTS_ENABLE) || \
			(USART32_ENABLE && USART32_RTS_ENABLE)
		cr3 |= STM32_USART_CR3_RTSE;
		#endif
		break;
	#endif
	#if USART03_ENABLE
	case 3:
	#endif
	#if USART04_ENABLE||USART03_ENABLE
	case 4:
		module_hz = info->apb1_freq_hz;
		#if 	(USART03_ENABLE && USART03_TX_ENABLE)||\
			(USART13_ENABLE && USART13_TX_ENABLE)||\
			(USART04_ENABLE && USART04_TX_ENABLE)||\
			(USART14_ENABLE && USART14_TX_ENABLE)
		cr1 |= STM32_USART_CR1_TE;
		#endif
		#if 	(USART03_ENABLE && USART03_RX_ENABLE)||\
			(USART13_ENABLE && USART13_RX_ENABLE)||\
			(USART04_ENABLE && USART04_RX_ENABLE)||\
			(USART14_ENABLE && USART14_RX_ENABLE)
		cr1 |= STM32_USART_CR1_RE;
		#endif
		break;
	#endif
	#if USART05_ENABLE
		case 5:
		module_hz = info->apb2_freq_hz;
		#if (USART05_ENABLE && USART05_TX_ENABLE) || \
			(USART15_ENABLE && USART15_TX_ENABLE)
		cr1 |= STM32_USART_CR1_TE;
		#endif
		#if (USART05_ENABLE && USART05_RX_ENABLE) || \
			(USART15_ENABLE && USART15_RX_ENABLE)
		cr1 |= STM32_USART_CR1_RE;
		#endif
		#if (USART05_ENABLE && USART05_CK_ENABLE) || \
			(USART15_ENABLE && USART15_CK_ENABLE)
		cr2 |= STM32_USART_CR2_CLKEN;
		#endif
		#if (USART05_ENABLE && USART05_CTS_ENABLE) || \
			(USART15_ENABLE && USART15_CTS_ENABLE)
		cr3 |= STM32_USART_CR3_CTSE;
		#endif
		#if (USART05_ENABLE && USART05_RTS_ENABLE) || \
			(USART15_ENABLE && USART15_RTS_ENABLE)
		cr3 |= STM32_USART_CR3_RTSE;
		#endif
		break;
	#endif
	#if USART06_ENABLE
		case 6:		
	#endif
	#if USART07_ENABLE||USART06_ENABLE
		case 7:	
		module_hz = info->apb1_freq_hz;
		#if 	(USART06_ENABLE && USART06_TX_ENABLE)||\
			(USART16_ENABLE && USART16_TX_ENABLE)||\
			(USART07_ENABLE && USART07_TX_ENABLE)||\
			(USART17_ENABLE && USART17_TX_ENABLE)
		cr1 |= STM32_USART_CR1_TE;
		#endif
		#if 	(USART06_ENABLE && USART06_RX_ENABLE)||\
			(USART16_ENABLE && USART16_RX_ENABLE)||\
			(USART07_ENABLE && USART07_RX_ENABLE)||\
			(USART17_ENABLE && USART17_RX_ENABLE)
		cr1 |= STM32_USART_CR1_RE;
		#endif
		break;
	#endif
	default:
		return VSFERR_NOT_SUPPORT;
	}
	

	cr1 |= ((uint32_t)mode << 9) & 0x0600;
	cr1|=0x0000400c;
	cr2 |= ((uint32_t)mode << 7) & 0x3600;
	
	// baudrate
	divider = module_hz / baudrate;
	mantissa = divider / 16;
	fraction = divider - mantissa * 16;
	usart->BRR = (mantissa << 4) | fraction;
	usart->SR=0x00000000;
	usart->CR1 = cr1;
	usart->CR2 = cr2;
	usart->CR3 = cr3;
	usart->CR1 |= STM32F4_USART_CR1_UE;
	return VSFERR_NONE;	
}


vsf_err_t stm32f4_usart_fini(uint8_t index)
{
	USART_TypeDef *usart;
	uint8_t usart_idx = index & 0x0F;
	uint8_t remap_idx = (index >> 4) & 0x0F;
	
#if __VSF_DEBUG__
	if (usart_idx >= USART_NUM)
	{
		return VSFERR_NOT_SUPPORT;
	}
#endif
	usart = (USART_TypeDef *)stm32f4_usarts[usart_idx];
	
	usart->CR1 = 0;
	switch(usart_idx)
	{
	#if USART00_ENABLE || USART10_ENABLE	
		case 0:
		RCC->APB2ENR&=(uint32_t)(~RCC_APB2ENR_USART1EN);
		switch(remap_idx)
		{
			case 0:
			break;
			case 1:
			break;
		}
		break;
	#endif	
		case 1:
		break;
		case 2:
		break;
		case 3:
		break;
		case 4:
		break;
		case 5:
		break;
		case 6:
		break;
		case 7:
		break;
	}
}


vsf_err_t stm32f4_usart_config_callback(uint8_t index, uint32_t int_priority,
				void *p, void (*ontx)(void *), void (*onrx)(void *, uint16_t))
{
	USART_TypeDef *usart;
	uint8_t usart_idx = index & 0x0F;
	uint32_t cr1 = 0;
	uint8_t irqn;
	
#if __VSF_DEBUG__
	if (usart_idx >= USART_NUM)
	{
		return VSFERR_NOT_SUPPORT;
	}
#endif
	usart = (USART_TypeDef *)stm32f4_usarts[usart_idx];
	irqn = stm32f4_usart_irqn[index];
	
	stm32f4_usart_ontx[usart_idx] = ontx;
	stm32f4_usart_onrx[usart_idx] = onrx;
	stm32f4_usart_callback_param[usart_idx] = p;
	if (ontx != NULL)
	{
		cr1 |= STM32F4_USART_CR1_TCIE;
	}
	if (onrx != NULL)
	{
		cr1 |= STM32F4_USART_CR1_RXNEIE;
	}
	usart->CR1 &= ~(STM32F4_USART_CR1_TCIE | STM32F4_USART_CR1_RXNEIE);
	usart->CR1 |= cr1;
	
