ff8zgs/vsf/vsf/interfaces/cpu/stm32f4/usart/stm32f4usart.c
	if ((ontx != NULL) || (onrx != NULL))
	{
		NVIC->IP[irqn] = int_priority;
		NVIC->ISER[irqn >> 0x05] = 1UL << (irqn & 0x1F);
	}
	else
	{
		NVIC->ICER[irqn >> 0x05] = 1UL << (irqn & 0x1F);
	}
	return VSFERR_NONE;
}

vsf_err_t stm32f4_usart_tx(uint8_t index, uint16_t data)
{
	USART_TypeDef *usart;
	uint8_t usart_idx = index & 0x0F;
	
#if __VSF_DEBUG__
	if (usart_idx >= USART_NUM)
	{
		return VSFERR_NOT_SUPPORT;
	}
#endif
	usart = (USART_TypeDef *)stm32f4_usarts[usart_idx];
	
	usart->DR = data;
	return VSFERR_NONE;
}

uint16_t stm32f4_usart_rx(uint8_t index)
{
	USART_TypeDef *usart;
	uint8_t usart_idx = index & 0x0F;
	
#if __VSF_DEBUG__
	if (usart_idx >= USART_NUM)
	{
		return 0;
	}
#endif
	usart = (USART_TypeDef *)stm32f4_usarts[usart_idx];
	
	return usart->DR;
}

//#if USART0_INT_EN && (USART00_ENABLE || USART10_ENABLE)
#if 1
ROOTFUNC void USART1_IRQHandler(void)
{
	if ((stm32f4_usart_onrx[0] != NULL) && (USART1->SR & STM32F4_USART_SR_RXNE))
	{
		stm32f4_usart_onrx[0](stm32f4_usart_callback_param[0], USART1->DR);
	}
	if ((stm32f4_usart_ontx[0] != NULL) && (USART1->SR & STM32F4_USART_SR_TC))
	{
		stm32f4_usart_ontx[0](stm32f4_usart_callback_param[0]);
		USART1->SR &= ~STM32F4_USART_SR_TC;
	}
}
#endif

#if USART1_INT_EN && (USART01_ENABLE || USART11_ENABLE)
ROOTFUNC void USART2_IRQHandler(void)
{
	if ((stm32f4_usart_onrx[1] != NULL) && (USART2->SR & STM32_USART_SR_RXNE))
	{
		stm32f4_usart_onrx[1](stm32f4_usart_callback_param[1], USART2->DR);
	}
	if ((stm32f4_usart_ontx[1] != NULL) && (USART2->SR & STM32_USART_SR_TC))
	{
		stm32f4_usart_ontx[1](stm32f4_usart_callback_param[1]);
		USART2->SR &= ~STM32_USART_SR_TC;
	}
}
#endif

#if USART2_INT_EN && (USART02_ENABLE || USART12_ENABLE || USART32_ENABLE)
ROOTFUNC void USART3_IRQHandler(void)
{
	if ((stm32f4_usart_onrx[2] != NULL) && (USART3->SR & STM32_USART_SR_RXNE))
	{
		stm32f4_usart_onrx[2](stm32f4_usart_callback_param[2], USART3->DR);
	}
	if ((stm32f4_usart_ontx[2] != NULL) && (USART3->SR & STM32_USART_SR_TC))
	{
		stm32f4_usart_ontx[2](stm32f4_usart_callback_param[2]);
		USART3->SR &= ~STM32_USART_SR_TC;
	}
}
#endif

#if USART3_INT_EN && (USART03_ENABLE || USART13_ENABLE)
ROOTFUNC void USART4_IRQHandler(void)
{
	if ((stm32f4_usart_onrx[3] != NULL) && (UART4->SR & STM32_USART_SR_RXNE))
	{
		stm32f4_usart_onrx[3](stm32f4_usart_callback_param[3], UART4->DR);
	}
	if ((stm32f4_usart_ontx[3] != NULL) && (UART4->SR & STM32_USART_SR_TC))
	{
		stm32f4_usart_ontx[3](stm32f4_usart_callback_param[3]);
		UART4->SR &= ~STM32_USART_SR_TC;
	}
}
#endif

#if USART4_INT_EN && (USART04_ENABLE || USART14_ENABLE)
ROOTFUNC void USART5_IRQHandler(void)
{
	if ((stm32f4_usart_onrx[4] != NULL) && (UART5->SR & STM32_USART_SR_RXNE))
	{
		stm32f4_usart_onrx[4](stm32f4_usart_callback_param[4], UART5->DR);
	}
	if ((stm32f4_usart_ontx[4] != NULL) && (UART5->SR & STM32_USART_SR_TC))
	{
		stm32f4_usart_ontx[4](stm32f4_usart_callback_param[4]);
		UART5->SR &= ~STM32_USART_SR_TC;
	}
}
#endif

#if USART5_INT_EN && (USART05_ENABLE || USART15_ENABLE)
ROOTFUNC void USART6_IRQHandler(void)
{
	if ((stm32f4_usart_onrx[5] != NULL) && (USART6->SR & STM32_USART_SR_RXNE))
	{
		stm32f4_usart_onrx[5](stm32f4_usart_callback_param[5], UART6->DR);
	}
	if ((stm32f4_usart_ontx[5] != NULL) && (USART6->SR & STM32_USART_SR_TC))
	{
		stm32f4_usart_ontx[5](stm32f4_usart_callback_param[5]);
		USART6->SR &= ~STM32_USART_SR_TC;
	}
}
#endif

#if USART6_INT_EN && (USART06_ENABLE || USART16_ENABLE)
ROOTFUNC void USART7_IRQHandler(void)
{
	if ((stm32f4_usart_onrx[6] != NULL) && (UART7->SR & STM32_USART_SR_RXNE))
	{
		stm32f4_usart_onrx[6](stm32f4_usart_callback_param[6], UART7->DR);
	}
	if ((stm32f4_usart_ontx[6] != NULL) && (UART7->SR & STM32_USART_SR_TC))
	{
		stm32f4_usart_ontx[6](stm32f4_usart_callback_param[6]);
		UART7->SR &= ~STM32_USART_SR_TC;
	}
}
#endif

#if USART7_INT_EN && (USART07_ENABLE || USART17_ENABLE)
ROOTFUNC void USART8_IRQHandler(void)
{
	if ((stm32f4_usart_onrx[7] != NULL) && (UART8->SR & STM32_USART_SR_RXNE))
	{
		stm32f4_usart_onrx[7](stm32f4_usart_callback_param[7], UART8->DR);
	}
	if ((stm32f4_usart_ontx[7] != NULL) && (UART8->SR & STM32_USART_SR_TC))
	{
		stm32f4_usart_ontx[7](stm32f4_usart_callback_param[7]);
		UART8->SR &= ~STM32_USART_SR_TC;
	}
}
#endif

